tests/load/register.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      rampTo: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 5
      name: "Main load"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 3000
      - http.response_time.p99: 5000
      - http.errors: 0.1
  payload:
    path: "../data/organizations.csv"
    fields:
      - "name"
      - "email"
      - "password"
    order: "sequential"
    skipHeader: true

scenarios:
  - name: "Organization Registration Test"
    flow:
      - log: "Starting registration test"
      
      - post:
          url: "/api/auth/register"
          json:
            orgName: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "auth_token"
          expect:
            - statusCode: 201
            
      - think: 0.5